#Найти произведение ряда чисел от 1 до 10. Полученный результат вывести на экран.
p = 1

for i in range(1, 11, 1):
 p*=i


print(p)